{
  "posts": [
    {
      "id": "1",
      "title": "5 Tips for Maintaining Your Roof",
      "date": "August 1, 2025",
      "image": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&q=80",
      "content": "<p>Maintaining your roof is essential to ensure its longevity and protect your home. Here are five key tips to keep your roof in top condition:</p><ol class=\"list-decimal ml-6\"><li><strong>Regular Inspections</strong>: Schedule professional inspections at least twice a year to catch issues early.</li><li><strong>Clean Gutters</strong>: Remove debris from gutters to prevent water backup and damage to your roof.</li><li><strong>Trim Overhanging Branches</strong>: Prevent branches from scraping or falling onto your roof during storms.</li><li><strong>Check for Damage</strong>: Look for missing shingles, cracks, or leaks after severe weather.</li><li><strong>Address Issues Promptly</strong>: Fix small problems immediately to avoid costly repairs later.</li></ol><p>Contact Ibex Roofing Solutions for professional maintenance services to keep your roof in top shape.</p>",
      "summary": "Learn essential steps to keep your roof in top condition year-round."
    },
    {
      "id": "2",
      "title": "How to Choose the Right Roofing Material",
      "date": "July 15, 2025",
      "image": "https://images.unsplash.com/photo-1600566752355-35792bedcfea?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&q=80",
      "content": "<p>Choosing the right roofing material is a critical decision for homeowners. Here’s a guide to help you decide:</p><ul class=\"list-disc ml-6\"><li><strong>Asphalt Shingles</strong>: Affordable, durable, and available in various styles.</li><li><strong>Metal Roofing</strong>: Long-lasting and energy-efficient, ideal for modern homes.</li><li><strong>Clay Tiles</strong>: Elegant and durable, perfect for Mediterranean-style homes.</li><li><strong>Slate</strong>: Premium and long-lasting, but more expensive and heavier.</li></ul><p>Consider your budget, climate, and home style when choosing. Consult with our experts for personalized recommendations.</p>",
      "summary": "Explore the pros and cons of different roofing materials for your home."
    },
    {
      "id": "3",
      "title": "Preparing Your Roof for Storm Season",
      "date": "June 20, 2025",
      "image": "https://images.unsplash.com/photo-1600566752227-967f0b1df611?ixlib=rb-4.0.3&auto=format&fit=crop&w=1470&q=80",
      "content": "<p>Storm season can be tough on your roof. Follow these steps to prepare:</p><ul class=\"list-disc ml-6\"><li><strong>Inspect Your Roof</strong>: Check for loose or damaged shingles before storms hit.</li><li><strong>Secure Flashing</strong>: Ensure flashing around chimneys and vents is tight.</li><li><strong>Clear Debris</strong>: Remove leaves and branches to prevent water pooling.</li><li><strong>Reinforce Weak Areas</strong>: Strengthen vulnerable spots with professional repairs.</li></ul><p>Our emergency services are available 24/7 to handle storm-related damage. Contact us today!</p>",
      "summary": "Tips to ensure your roof withstands severe weather conditions."
    }
  ]
}